[
  {
    "review_id": "13576460127",
    "title": "TERRIBLE GAME",
    "text": "Please notice how most of the reviews were a year ago. Please do not download this game unless you want severe depression or have some sort of anger issues. I do not recommend playing this as a new player, insanely hard to climb ladder unless you pay or have been playing.",
    "rating": 1
  },
  {
    "review_id": "13578664186",
    "title": "Best game ever",
    "text": "Best game ever",
    "rating": 5
  },
  {
    "review_id": "13575859893",
    "title": "Stopped caring",
    "text": "The devs had a good game then they became greedy and ruined it for profit if you asked me a year ago I would say definitely download but now I strongly recommend never playing this game",
    "rating": 1
  },
  {
    "review_id": "13578499021",
    "title": "Clash Royale review",
    "text": "The game is absolutely amazing no lag clean looks nice plot the best game of 2025 happy new year And a very merry Christmas",
    "rating": 5
  },
  {
    "review_id": "13579017379",
    "title": "G",
    "text": "Guitar you paid to win🤬",
    "rating": 1
  },
  {
    "review_id": "13578167102",
    "title": "Clash Royale Sucks",
    "text": "This game is the worst I do not recommend it, the game will make you very mad and sad. Do not buy any of the in game purchases. Level 16 was the third worst idea behind Heroes and Mega Knight. The game is a lousy Pay to win. I recommend you to get ANY other game",
    "rating": 1
  },
  {
    "review_id": "13579227289",
    "title": "Don't spend money on this game",
    "text": "Playing this game without spending money is the best response to the game designers.",
    "rating": 1
  },
  {
    "review_id": "13576830848",
    "title": "Good game bad decisions",
    "text": "They are ruining my beloved clash royal it’s almost unrecognizable.",
    "rating": 1
  },
  {
    "review_id": "13577776436",
    "title": "Amazing game",
    "text": "Bro this game is so good and so ez and just downright fun hope this review helps",
    "rating": 5
  },
  {
    "review_id": "13578465598",
    "title": "crash out",
    "text": "this game sucks as soon as you reach arena 20 you can’t win cuz there are only pay to play players. i got so mad after losing for the umpteenth time that i threw my brand new Iphone 17 pro max against my wall. It’s completely broken and i blame supercell",
    "rating": 1
  },
  {
    "review_id": "13576848915",
    "title": "Review",
    "text": "Tell me how they can have two different types of hero’s and evos this is p2w now every time I do slightly good all of a sudden I lose the next 5 games",
    "rating": 1
  },
  {
    "review_id": "13578137499",
    "title": "Ruined the game",
    "text": "Ever since implementing hero cards and evolution cards, it has ruined the game .",
    "rating": 1
  },
  {
    "review_id": "13575559934",
    "title": "So goon",
    "text": "It’s a very fun game to play even though I suck and my friend has to guide me",
    "rating": 5
  },
  {
    "review_id": "13578199265",
    "title": "Just wonderful",
    "text": "It may be an addicting game, but it has come back!",
    "rating": 5
  },
  {
    "review_id": "13579040885",
    "title": "This game sucks balls",
    "text": "Horrible",
    "rating": 1
  },
  {
    "review_id": "13578533484",
    "title": "El mejor juego de la historia",
    "text": "Me gusta i conseguí el megacaballero😀",
    "rating": 5
  },
  {
    "review_id": "13578109148",
    "title": "Skam Royale.",
    "text": "Greedy Royale is nothing but a money hungry, pay to win, addictive, deceitful, backstabbing, time-consuming, unforgiving, corrupt, and straight-up never satisfied even if they collected your very soul excuse of a game. Turn back now and keep your sanity/financial stability.",
    "rating": 5
  },
  {
    "review_id": "13579292000",
    "title": "Nelson",
    "text": "I like it",
    "rating": 5
  },
  {
    "review_id": "13575411569",
    "title": "Unfair matchups",
    "text": "This game is rigged. If you don’t spend then you won’t win. The game is setup against you so you HAVE to buy all the upgrades. If you don’t… expect to play against opponents with decks full of level 16 troops even if you don’t even have a single one. They also delete negative reviews so the rating is artificially inflated.",
    "rating": 1
  },
  {
    "review_id": "13577678331",
    "title": "P2W",
    "text": "Supercell’s greed is of biblical proportions. Gave up on evolutions just to make heroes, which have made the game far more pay to win. Constant match ups against overleveled cards and underleveled towers. I’ve been playing for years, and I’m truly just disappointed at how terrible this game has become. Do better Supercell. You’re losing a lot of players because you’re screwing up the game.",
    "rating": 1
  },
  {
    "review_id": "13579279534",
    "title": "It’s not fair",
    "text": "Fix your damn game can’t even yall literally giving elixir faster to the opponent than me💔",
    "rating": 1
  },
  {
    "review_id": "13578085277",
    "title": "Do not get it",
    "text": "It is fun but they will always ruin the game for the sake of profit",
    "rating": 1
  },
  {
    "review_id": "13575323499",
    "title": "Supercell tiene algo contra mío",
    "text": "Bro supercell di si tenes algo contra mío a una partida y me empareja con hardcounter para fastidiar",
    "rating": 4
  },
  {
    "review_id": "13577802586",
    "title": "Mega knight",
    "text": "Too much mega knight spam and takes no skill",
    "rating": 4
  },
  {
    "review_id": "13575339670",
    "title": "Great game to Awful",
    "text": "This game was great. Then they started adding more cards. Which was even better! Then there was a pattern forming for the cards they were adding. Each new season, a new broken card was added to the game. For this card, you have to pay for it!!! Why….",
    "rating": 1
  },
  {
    "review_id": "13577848868",
    "title": "fix your bs",
    "text": "no one at supercell listens to the community you guys add heros and a terrible match making system you guys all smoke meth",
    "rating": 1
  },
  {
    "review_id": "13578058403",
    "title": "Cons/Pros",
    "text": "The problems with the game I’m playing against people with two hero’s it’s to op why can people have a hero musketeer hitting my tower with her turret with hero knight distracting my troops so musketeer is shredding my towers it’s too broken need ONE hero slot!!! Pros once you get a evo it’s cool especially when you get an hero it looks so cool and you get hype and it’s really fun to have a good deck and exciting! (Why do we have lvl 16 you said 15 was all like bruh, listen to jynxzi and stop adding things people didn’t ask for",
    "rating": 3
  },
  {
    "review_id": "13578883453",
    "title": "This game is good",
    "text": "No words… Perfect game too addicting.",
    "rating": 5
  },
  {
    "review_id": "13575394024",
    "title": "Shameless money grab. Save your time",
    "text": "Matchmaking puts you against decks with cards you have to buy to beat. Pay to win. Fix this $#!¥ or I’m gone",
    "rating": 1
  },
  {
    "review_id": "13577240398",
    "title": "Very fun",
    "text": "It’s fun cause it is",
    "rating": 5
  },
  {
    "review_id": "13578828098",
    "title": "stupid update",
    "text": "this game was completely ruined when the developers decided to add heros, this completely made the game pay to win and its so stupid and unnecessary the developers ruined the game with their greed.",
    "rating": 1
  },
  {
    "review_id": "13578639464",
    "title": "Greed.",
    "text": "This company is obnoxious to put the least. If youvenever played, DONT!! If your still playing, you hate it! Not worth wasting your time and energy on. Genuinely.",
    "rating": 1
  },
  {
    "review_id": "13578338687",
    "title": "Why",
    "text": "Please Nerf the royal recruits",
    "rating": 3
  },
  {
    "review_id": "13579082518",
    "title": "Nah",
    "text": "Be an adult and play Clash of Clans. CR was fun for a minute but there’s only so much you can do with tower defense 1 v 1 games. This one has ran its course.",
    "rating": 1
  },
  {
    "review_id": "13577647201",
    "title": "Mega night",
    "text": "Mega night",
    "rating": 5
  },
  {
    "review_id": "13575752230",
    "title": "Review",
    "text": "This game is pay to survive and money hungry, all I go up against is higher level players players. The meda is trash. I consider u new people don’t level up your princes towers too much than your supposed to for your arena, if you do your gonna play over leveled players.",
    "rating": 1
  },
  {
    "review_id": "13578915755",
    "title": "Probably the worst dev team out there",
    "text": "Took a great game and made it garbage, homemade deck to 15k, gonna delete the game",
    "rating": 1
  },
  {
    "review_id": "13578051053",
    "title": "Bad game",
    "text": "I never win",
    "rating": 5
  },
  {
    "review_id": "13578286175",
    "title": "Horrible",
    "text": "This Game Is so Bad Bro. All It wants Is for you To Pay. Every Time I’m About to enter a new arena I’m Put up Against an Over leveled Player. You Can’t Play the game Without Paying to Win. Don’t Get the Game",
    "rating": 4
  },
  {
    "review_id": "13578083193",
    "title": "Its fun",
    "text": "The game is fun but once you reach higher arenas ppl be hacking and cheating its obvious. Double playing cards they just used and using cards together that requires 14 or more mana but spamming them? Its kinda a joke",
    "rating": 3
  },
  {
    "review_id": "13578028826",
    "title": "The best game ever",
    "text": "It is the best game in the world and I love it I would stay on it for hours",
    "rating": 5
  },
  {
    "review_id": "13578849316",
    "title": "Unfair Gameplay",
    "text": "Clash Royale just isn’t fun anymore. The devs feel greedy, constantly pushing paid stuff while refusing to properly balance cards. Some cards stay broken forever and it makes matches feel so unfair and pay to win. Skill matters less than your wallet now. So many people refuse to delete the game because of the time and money they've wasted, and it was a great decision for me to get rid of this app.",
    "rating": 1
  },
  {
    "review_id": "13577369385",
    "title": "Very pay to win",
    "text": "This game is fun but insanely pay to win and really just based on luck and who’s willing to spend the most money",
    "rating": 1
  },
  {
    "review_id": "13579254942",
    "title": "This game is so garbage!",
    "text": "Do not recommend!",
    "rating": 5
  },
  {
    "review_id": "13578854029",
    "title": "Devs don’t care",
    "text": "Pay to win game. The devs don’t care about the game anymore and are trying to milk as much money out of the game as possible before it dies. i’ve been playing for so long and the heroes update was my final straw.",
    "rating": 1
  },
  {
    "review_id": "13579181047",
    "title": "trash and p2w",
    "text": "Hope you fix your rigged game one day jewpercell 🗑️❤️",
    "rating": 1
  },
  {
    "review_id": "13579241536",
    "title": "Clash",
    "text": "It’s the best game in the world",
    "rating": 5
  },
  {
    "review_id": "13576200238",
    "title": "Great game",
    "text": "This is one of the best games ever it is so interactive and is so fun to play. I really like that we get to meet new people on this game. Long story short I love this game and I can’t wait to play more.",
    "rating": 5
  },
  {
    "review_id": "13578135985",
    "title": "I hate you",
    "text": "I love you clash you make my emotions spiral!",
    "rating": 1
  },
  {
    "review_id": "13576298722",
    "title": "Oh my gosh why",
    "text": "I used to love this game it was like the best game ever when I was younger but now they added all these pay to win things and no skill cards like mega knight and evolution witch. Oh my gosh I like this game a lot and it brings back memories but it is so fricking annoying when you try to play for one second and someone just puts down a stupid mega knight with an evo witch behind it. If I had to play this game for an hour and the timer resets every time you see an evo witch or mega knight or even any kind of no skill player, I would probably either be stuck forever or just try to kill myself ( I know that sounds horrible but in that situation, it’s justified a little bit I guess ) I’m not even gonna rate it 5 stars to get attention because literally every other review is 5 stars. They are all from like a year ago so they probably are not that accurate. Also new heroes are so annoying so yea. 2 stars because it used to be best ever but now it is pay to win trash (no offense supercell I like clash of clans it is still good)",
    "rating": 3
  },
  {
    "review_id": "13579334634",
    "title": "Good",
    "text": "Fun",
    "rating": 5
  },
  {
    "review_id": "13576125831",
    "title": "Game is getting worse",
    "text": "Evo and other updates destroyed the game is now pay for win and even without fun",
    "rating": 1
  },
  {
    "review_id": "13575923538",
    "title": "Garbage game",
    "text": "P2W, don’t play this slop",
    "rating": 1
  },
  {
    "review_id": "13578500887",
    "title": "Upgraded my mini P.E.K.K.A",
    "text": "I upgraded my mini P.E.K.K.A to level 11 and it still was level 10.",
    "rating": 4
  },
  {
    "review_id": "13579235383",
    "title": "So fun",
    "text": "Had a great time! Played for hours.",
    "rating": 5
  },
  {
    "review_id": "13577222606",
    "title": "Merge tactics",
    "text": "Пздц конечно у система работает 7 очков, я выиграл подряд 3 оставили ему 1, в итоге он апнул всех до золота, и выиграл 1 бой, слили мне сразу 7. Круто! Конченые ска.",
    "rating": 1
  },
  {
    "review_id": "13578938486",
    "title": "The best game ever",
    "text": "This is the best game ever because it just is great to play on like Roblox and stuff like that are hard to play on but this game way easier to play",
    "rating": 5
  },
  {
    "review_id": "13577053577",
    "title": "Найс игра",
    "text": "Сыграл с другом 5 игр, все всосал. Мои юниты не успели перейти речку а он уже снес мне короля",
    "rating": 1
  },
  {
    "review_id": "13578082593",
    "title": "to many bad cards hard to play get rid of some cards so people can play",
    "text": "0 game sucks",
    "rating": 1
  },
  {
    "review_id": "13578713208",
    "title": "Terible this game sucks",
    "text": "Who plays this game anymore it sucks so much super sell you make the game ten times worse all people do now in days is just pay to win all they do is spam and people crash out while you make 5000 dollars and keep adding things like hero’s and you keep getting more money this game suck asssss",
    "rating": 1
  },
  {
    "review_id": "13577542599",
    "title": "So good",
    "text": "So good",
    "rating": 5
  },
  {
    "review_id": "13577638747",
    "title": "Easily assessable",
    "text": "This game is simply a pay 2 win game. Nothing kore, nothing least. Just better artistic slip that still is not that good in the long run, just like every mobile game just about now",
    "rating": 1
  },
  {
    "review_id": "13577313388",
    "title": "Why clash sucks",
    "text": "First as soon as I am one win away form the next arena they put me against the most sweaty person ever also the developers are js money hungry and every fight I do all I hear is MEGA KNIGHT",
    "rating": 2
  },
  {
    "review_id": "13578329788",
    "title": "Trash",
    "text": "If you like to play games that cheat. This is the game for you Nothing but target manipulation, delayed troop deployments, variable sounds, and bots. I play golem pump, and never is my pump in any of the first 6 cards. Always in the 7 th to eight card rotation. Your cards never do what they are supposed to do, but your opponents cards sure will some how This is not random, they love to create patterns of losing. It’s not tilting. They will have win one lose 3 kind of nonsense so they you will spend money on the game. This game cheats all day everyday They are a pathetic company that offers no explanation or customer service. Just cheating . They record the game play and do nothing to acknowledge what they just saw The biggest cheats in the game They should change their name to supercheats They suck",
    "rating": 1
  },
  {
    "review_id": "13575671312",
    "title": "Pay to win",
    "text": "This game is slowly becoming a pay to win game",
    "rating": 3
  },
  {
    "review_id": "13577592339",
    "title": "Sucks",
    "text": "Fun game but supercell being greedy absolutely ruined it now I can’t win a round bc of the dumb pay to win players",
    "rating": 2
  },
  {
    "review_id": "13579341513",
    "title": "Pancakes",
    "text": "Mini pekka is the goat",
    "rating": 5
  },
  {
    "review_id": "13578583780",
    "title": "Player since release almost max account truths",
    "text": "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$GAME OF WAR just different gameplay. I’ve uninstalled because the game is not fun and consistent anymore. Don’t be fooled by download being free. I’ve been playing for 9 years and and seen all stages. My main deck is maxed (lvl 16) and Ive grinded out the most recent update. The month to month meta gets very old. A paid game is cheaper and more fun. To give you a scope of reference of how much it really costs. It’s 100+$$$ dollars for a single deck of 8 cards to go from level 15-16. Probably 500$+ if you don’t have level 15. It took me multiple years to even get to 15. Then on top of that they add evos and heros which cost around 15 dollars each. It takes 3 months to unlock 1 evo of your choice for free and that’s fine. However heros take longer and you can’t choose. It’s clear this is any other money grab that you can scroll through this App Store for. It wasn’t like this all the time but that’s what it is now. I really loved this game all the way up until this. In November I had over 100 hrs in December maybe 40 now nothing. I know you guys at tencent and supercell love this so here you go. $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$",
    "rating": 1
  },
  {
    "review_id": "13577542638",
    "title": "Generational game",
    "text": "Only game I play as an adult",
    "rating": 5
  },
  {
    "review_id": "13575683966",
    "title": "👍",
    "text": "very good and fun game",
    "rating": 5
  },
  {
    "review_id": "13578377455",
    "title": "pay 2 win and random kids with infinite elixir",
    "text": "don't give your money, unless you hate money",
    "rating": 1
  },
  {
    "review_id": "13575732835",
    "title": "To p2w",
    "text": "This game is fun I play with my friends a lot but when I play there’s always like a lvl 13 tower in arena 9",
    "rating": 2
  },
  {
    "review_id": "13576462602",
    "title": "This game sucks fix ur game",
    "text": "I Always get delay or my npc ignores the enemy's npc and k don't think it's fair FIX UR GAME",
    "rating": 1
  },
  {
    "review_id": "13577590538",
    "title": "Toxic",
    "text": "Make it less toxic",
    "rating": 1
  },
  {
    "review_id": "13579030661",
    "title": "Hehheheha",
    "text": "Heheheha",
    "rating": 5
  },
  {
    "review_id": "13578053549",
    "title": "Gameplay",
    "text": "I have played this game since the beginning. Unfortunately what used to be one of my favorite games to play has now became one I will not be supporting no longer. The core gameplay of this game were quite amazing such fun strategy. Now this has completely removed the gameplay solely relies on the new purchase of “Hero’s” with these added features it makes the gameplay no longer about strategy and deck building but about what’s the latest update. Supercell has longly not been listing to the community and its request, instead they are forcing the decline of their game through horrendous changes. I truly hope they can turn it around. Good luck to any free to play player attempting to play this.",
    "rating": 1
  },
  {
    "review_id": "13578360331",
    "title": "toxic player base",
    "text": "all players are toxic and updates make it pay to win",
    "rating": 1
  },
  {
    "review_id": "13577735711",
    "title": "This game is fun but makes u crash out",
    "text": "There r people who buy stuff in the game so they can beat and it make u super mad and when you r close to arena and u lose u crash out and they taunt you when u lose so u crash out",
    "rating": 3
  },
  {
    "review_id": "13576922034",
    "title": "Ruined",
    "text": "This game was good in low trophies, now in mid ladder, these idiots tend to spend 20+ elixir on a push. Not only that but the hero’s ruined the game. Imagine going against a mini pekka and almost killing it, but then it’s level 21 and restores half of its health, then proceeds to destroy your tower. I mean hero giant is okay but freaking hero knight is as annoying as hell. If you just put down a win condition, then place a hero knight, when you press the ability, everything focuses on him. Supercell only wanted to add heroes for money. Which explains why I went against a level 15 witch in arena 16.",
    "rating": 1
  },
  {
    "review_id": "13578842644",
    "title": "Fun",
    "text": "Super fun addicting but so fun I have been playing for 50 days strait try it out",
    "rating": 5
  },
  {
    "review_id": "13575802375",
    "title": "Was decent",
    "text": "Game is to much pay to win to max account would costs thousands of dollars and the matching is terrible hard counters after you start wining its terrible way to keep players. That why stoped playing game would be so easy to be the best mobile if they cared about the players obvious they don’t care anything other than profit that will not last forever that why game dies and comes back. This game can be so much better.",
    "rating": 1
  },
  {
    "review_id": "13579346140",
    "title": "Clash royale",
    "text": "You need to make a evolution mini pekka the concepts will be memhnet and the micro pekkas will release a zap explosion on death and the evolution mini pekka sword will get more powerful after every swing and the evolution mini pekka will spawn smaller evolution mini pekkas that have half the heath have the speed and half the damage the evolution will be one cycle will be one cycle there will be offer in every arena that allows you to get the evolution for 300 gems",
    "rating": 5
  },
  {
    "review_id": "13579146035",
    "title": "Clash royale",
    "text": "Jijijaja😂😂😂",
    "rating": 5
  },
  {
    "review_id": "13577200248",
    "title": "no",
    "text": "I swear to god this game is so boring yet so addictive and i hate it. My phone won’t let me delete it, and when you lose one game you lose like the next 50. And why is this game over 1.2 GB? If i can’t delete this game, how about you do it, Supercell? Please don’t install this, it will save you a ton.",
    "rating": 1
  },
  {
    "review_id": "13577794391",
    "title": "The only way this game functions is by supercell rigging the matchmaking",
    "text": "Game is complete trash no skill required match up based junk. They let you win a few games then it’s just hardcounter after hard counter",
    "rating": 1
  },
  {
    "review_id": "13578346365",
    "title": "Don’t play clash royale",
    "text": "You will get destroyed and become ptw beware",
    "rating": 1
  },
  {
    "review_id": "13579121544",
    "title": "i like it",
    "text": "i really like this game I just got someone so fast i like it",
    "rating": 5
  },
  {
    "review_id": "13578995375",
    "title": "READ BEFORE PLAYING",
    "text": "This game… time and time again, will let you down For SOME reason, unknown to most, supercell likes to make this game unplayable. Like questioning your sanity unplayable… I am a veteran player, Ranked very highly, and I wish I never installed the app. I could have done so much more with my time.. done so many other things.. learn an instrument, picked up a skill. But no. I decided to play a game developed by the one company that wants the game to die SO BADLY, that they make it utter garbage. This is NOT why we clash. I explore you, don’t waste your time on this ridiculous game",
    "rating": 1
  },
  {
    "review_id": "13577881098",
    "title": "Lvl 16, heroes",
    "text": "What a way to kill a game. Greedy company",
    "rating": 1
  },
  {
    "review_id": "13577783812",
    "title": "Bueno",
    "text": "Bueno",
    "rating": 4
  },
  {
    "review_id": "13575794448",
    "title": "Implement a win/loss record",
    "text": "I recently started playing again after many years. However I would love to know how many losses I have as-well as wins. So therefore I suggest you implement our “losses” I suggest this because i’m very competitive and would like to know my win-loss ratio. A very strategic game here. I started yesterday and i believe my record is 41-10 (Trophy Road) Although I am not sure, I would like to know my correct record. Thank you super cell! Cheers mates! 👑",
    "rating": 5
  },
  {
    "review_id": "13575356999",
    "title": "BEST GAME EVER (read please!!)",
    "text": "This game isn’t a game you’ll get hooked on for a lil bit yeah it’ll be fun but dude. When you get to 5k you’ll hate yourself DO NOT PLAY THIS GAME it’s rage bait I wish I would’ve known what this game truly was before I played it I hate it. The matchmaking is absolutely crazy it’s full of pay to wins and pay to wins. Only play this if you hate yourself. The developers suck they add more and more op things and lock them behind a pay wall, DO NOT PLAY THIS GAME",
    "rating": 5
  },
  {
    "review_id": "13578993874",
    "title": "Screw evo",
    "text": "Pay to win game now if sucks.",
    "rating": 1
  },
  {
    "review_id": "13578250575",
    "title": "I love Clash Royale",
    "text": "Clash shows teamwork through 2v2. It also includes two games in one Merge Tactics and the game itself. This game is not like other mobile games it has events unlike other games when it’s Winter from Winter to Spring they actually update the game every week and sometimes every day. Thats why I love Clash",
    "rating": 5
  },
  {
    "review_id": "13578733189",
    "title": "Dumbest game ever",
    "text": "So tired of the pay to win gameplay and simply toxic players in the game. Fix your game supercell",
    "rating": 1
  },
  {
    "review_id": "13577322938",
    "title": "Clash Royale",
    "text": "Game is horrible how is it every time I’m winning you guys make me lag trash game don’t recommend ever buying or playing it.",
    "rating": 1
  },
  {
    "review_id": "13575556740",
    "title": "Still a bad game",
    "text": "Jesus the amount of micro transactions and pay to win features is insane just kill the game already. Ladder isnt even fun anymore and is so one sided, at this point the developers need to stop ruining the game",
    "rating": 1
  },
  {
    "review_id": "13578243043",
    "title": "P2W",
    "text": "The game is way P2W since the hero’s came out. The devs are just money hungry",
    "rating": 1
  },
  {
    "review_id": "13577760203",
    "title": "Holy broken",
    "text": "I have the 10 year badge on my account and this isnt even my first account ive played this game consistently for so long and always thought it was the best phone game but about the time they added evolution to the game its harded to pick it up and now heros this game was always pay to win but now its a whole new level stop making the game so complicated just to make yourself extra money instead of introducing some stupid mechanic just fix what you have",
    "rating": 1
  },
  {
    "review_id": "13578586043",
    "title": "Money Hungry company",
    "text": "would be a top tier videogame if it wasn’t runed by such a needy company that only cares about getting more money, adding nonsense to the game to the point that it’s unplayable unless you spend hundreds of dollars to now level up your cards to level 16! nice job supercell, just when your game was kinda getting somewhere, your greed couldn’t handle it.",
    "rating": 1
  }
]