[
  {
    "review_id": "13534815383",
    "title": "Information",
    "text": "Evert Escorcia",
    "rating": 5
  },
  {
    "review_id": "13539819110",
    "title": "This is great",
    "text": "Number1",
    "rating": 5
  },
  {
    "review_id": "13539407061",
    "title": "The feed",
    "text": "My feed on Facebook is ALWAYS refreshing. I can’t read a single post and get a notification without the stupidity app refreshing. This is also why I quit using Safari. Plus all the AI Garbage slop all over everything. Talk should be ashamed to have your names associated with this cesspool of an app",
    "rating": 1
  },
  {
    "review_id": "13534764754",
    "title": "Not worthwhile.",
    "text": "Not a place to spend much time. A wasteland",
    "rating": 1
  },
  {
    "review_id": "13535043715",
    "title": "Facebook: Where Bullies Thrive and Truth Gets Banned",
    "text": "The Facebook app is a frustrating, biased mess that prioritizes control over fairness. Meta’s moderation is notoriously selective: inflammatory, antagonistic content often stays up unchecked, while honest, candid responses defending yourself get flagged as “violations,” leading to arbitrary restrictions or bans. This hypocrisy reveals a clear ideological slant in enforcement, where certain viewpoints are protected and others swiftly silenced. At its core, Facebook is antithetical to free speech, operating as a private platform that censors under the guise of “community standards” while amplifying divisive algorithms for engagement. Worst of all, it’s profoundly detrimental to children’s mental health—studies link heavy use to increased anxiety, depression, and body image issues due to endless comparison, cyberbullying, and addictive design. Avoid this toxic app; there are better ways to stay connected. 1/5 stars.",
    "rating": 1
  },
  {
    "review_id": "13535670359",
    "title": "What has happened to FB?",
    "text": "I use to enjoy keeping up with friends and family. Now I get 85% ads or things I am not interested in.",
    "rating": 2
  },
  {
    "review_id": "13535124437",
    "title": "Facebook",
    "text": "It’s going down",
    "rating": 5
  },
  {
    "review_id": "13534484085",
    "title": "Ad office",
    "text": "10s back to back ad",
    "rating": 1
  },
  {
    "review_id": "13532998473",
    "title": "La vida es una sola y si la cuidamos tendremos una vejez digna",
    "text": "Vive al máximo sin hacer daño",
    "rating": 5
  },
  {
    "review_id": "13534746994",
    "title": "Sick of democrat stuff and all the trump bashing",
    "text": "Using Facebook to put false information and gay tranny stuff all over my page makes me want to throw up and it’s getting old",
    "rating": 1
  },
  {
    "review_id": "13538581975",
    "title": "20 years on Facebook and this is what they’ve done to me",
    "text": "I can’t believe this. I PAID for Meta Verified to PROTECT my business account as well as my personal account. 20 years of photos and precious memories of family, friends, and milestones ALL GONE. My business pages intellectual property, advertising campaigns, client and professional network built over years and years of hardworking— GONE! Meta, parent company of Facebook and Instagram, has implemented a defunct AI system that has been notoriously banning innocent users for false accusations or fraud, deception, and S.E of children. You can click a button to “appeal” the decision but guess who reviews the appeal… you guessed it, their defunct AI system! And forget about their false advertisement that if you pay $149 a month for meta verified business and $15 a month for personal accounts that you will have next level customer service and access to a human. I can’t reach a human because you can only reach their customer service chat system via your account and that’s a complete fail when I CANT ACCESS MY ACCOUNT. I have spent thousand in advertising for my reputable business. I have been with Facebook before Facebook was used by people over 25 years old. The fact that I had a benign grandma account with cats, kids, and a 5 star business get shut down is absurd. Meanwhile, when I reported REAL fraud accounts and TOS violations from bot users and scammers, Facebook did NOTHING to shut them down. My neighbors account was hacked and the scammer was selling and defrauding people thousands of dollars selling fake Taylor Swift tickets to the Eras tour. Users beware… print your photos and put them in an album. AI is going to ruin us.",
    "rating": 1
  },
  {
    "review_id": "13540279363",
    "title": "Ban Deodorant with Goosby Twins",
    "text": "Definitely trying it",
    "rating": 5
  },
  {
    "review_id": "13532734288",
    "title": "La mejor",
    "text": "Sus comidas bien Deli ,Deliiii",
    "rating": 5
  },
  {
    "review_id": "13538300244",
    "title": "Quá nhiều quảng cáo",
    "text": "Xem 1 clip chưa đầy 2 phút mà có tận 12 quảng cáo. Vừa tắt xong 5s sau lại quảng cáo tiếp. Lúc trước xem 1 clip chỉ quảng cáo 1-2 lần. Chán nản thật sự riết rồi facebook chỉ để xem quảng cáo thôi",
    "rating": 1
  },
  {
    "review_id": "13533576128",
    "title": "Wrapping gifts",
    "text": "Awesome",
    "rating": 5
  },
  {
    "review_id": "13539202350",
    "title": "GENIAL",
    "text": "UN POCO INCONFORME CUANDO UNO HACE UN REPORTE DE ALGÚN VIDEO O UN COMENTARIO",
    "rating": 5
  },
  {
    "review_id": "13536669039",
    "title": "No help",
    "text": "This app allows hackers to steal and get away with people’s accounts. No way to contact any and get help verifying yourself.",
    "rating": 1
  },
  {
    "review_id": "13536097928",
    "title": "Terrible platform",
    "text": "Great if you like AI slop and Boomer rants. Only on here because I need it for work.",
    "rating": 1
  },
  {
    "review_id": "13540328546",
    "title": "Very dysfunctional app",
    "text": "No customer service. Can’t add credit card to boost Marketplace listings. Allow people to pay for customer service instead of robbing them from so much wasted time.",
    "rating": 1
  },
  {
    "review_id": "13533107368",
    "title": "Cuando subo un video a mi historia tarda más de una hora en subirse quisiera saber por qué",
    "text": "Cuando subo un video a mi historia tarda más de una hora en subirse quisiera saber por qué",
    "rating": 1
  },
  {
    "review_id": "13534496733",
    "title": "Sharing posts",
    "text": "You can no longer see who shared a post, just how many times it was shared.",
    "rating": 3
  },
  {
    "review_id": "13540165288",
    "title": "To political",
    "text": "To many fact checkers",
    "rating": 1
  },
  {
    "review_id": "13538650277",
    "title": "Love you always!!",
    "text": "You",
    "rating": 5
  },
  {
    "review_id": "13540093472",
    "title": "Fabulous Friends and Food",
    "text": "Love coming here to meet friends, laugh, eat and celebrate! The cheese burger is great. Justin is the best bartender and person!",
    "rating": 5
  },
  {
    "review_id": "13538696353",
    "title": "Terrible app",
    "text": "Wish I could rate it 0 stars because one is too kind this app sucks it kicks you out your account every day and you won’t log in for a week I just got screwed over from my only source of income (Facebook marketplace) cuz I can’t log in now",
    "rating": 1
  },
  {
    "review_id": "13539055347",
    "title": "Can’t see shares",
    "text": "You can’t click on shares anymore and see who shared a post and what they said. Also i feel like you should be able to see all of your shares no matter the privacy settings.",
    "rating": 2
  },
  {
    "review_id": "13535703447",
    "title": "Ya making me mad",
    "text": "Yeo I’m not gon lie stop taking away the option to see the shares fr",
    "rating": 1
  },
  {
    "review_id": "13533566952",
    "title": "Aquí se viola tu derecho a la libre expresión",
    "text": "En esta aplicación si no gusta lo que dices simplemente te eliminan la cuenta y no te dan razones",
    "rating": 1
  },
  {
    "review_id": "13533599473",
    "title": "Just an app for ads",
    "text": "This app used to be incredible, where friends and family can share what’s going and post whatever. Now my entire feed is all just a bunch of companies. EVERY SINGLE VIDEO now has an ad banner blocking part of the video. At the end of the video? Yup ad. Even my notifications are showing me “ads I may be interested in.” Yeah this is ridiculous and not even worth using.",
    "rating": 1
  },
  {
    "review_id": "13535503617",
    "title": "Meet new friends",
    "text": "Oh it is exciting to wake up to see who has texted me. This app allows me to notify people when one is deceased or went into the hospital, birthday, anniversary, on anything big or small. Oh the marketplace, look for anything to buy or sell. You must get Facebook.",
    "rating": 5
  },
  {
    "review_id": "13537647087",
    "title": "Too much censorship",
    "text": "Facebook has way too much censorship the people who do fact check don’t really know what they’re doing and it is such a toxic site",
    "rating": 1
  },
  {
    "review_id": "13539040435",
    "title": "Comment section on reels won’t pull up all the way",
    "text": "Comment section for reels won’t pull up past a quarter of my screen. Makes it extremely hard to post a comment on reels.",
    "rating": 1
  },
  {
    "review_id": "13537427592",
    "title": "Da’ Book",
    "text": "I find it’s the best for actually communicating with other human beings and not being narrowly tailored for a focus on a singular mediums.",
    "rating": 5
  },
  {
    "review_id": "13537043473",
    "title": "Bugs not fixed",
    "text": "When opening app. There is only 1 post. App was updated yesterday.Turned phone off ect. Post are still ramdom up to 6 days ago. Come on fb do better",
    "rating": 3
  },
  {
    "review_id": "13536276376",
    "title": "It’s ok but",
    "text": "It’s too hard to find something that you recently saw, and it can be difficult to log in. It says click on your picture, but where is it if I haven’t signed in?",
    "rating": 3
  },
  {
    "review_id": "13539072004",
    "title": "Disappointed",
    "text": "To many ads and not showing friends comments",
    "rating": 1
  },
  {
    "review_id": "13536691713",
    "title": "Martires",
    "text": "Josem1948",
    "rating": 4
  },
  {
    "review_id": "13540339130",
    "title": "\"Something went wrong\"",
    "text": "I have notifications for the different sections like marketplace but if I actually try to open up postings, I keep getting the same error message with no fix. Just recently updated phone and app.",
    "rating": 2
  },
  {
    "review_id": "13535443176",
    "title": "me",
    "text": "me",
    "rating": 5
  },
  {
    "review_id": "13538344280",
    "title": "FB feed",
    "text": "I struggle understanding the algorithms. Why do I get feeds of people that are not my FB friends or even friends of my FB friends on my Facebook feed. I miss seeing the stuff my fiends post.",
    "rating": 2
  },
  {
    "review_id": "13537158587",
    "title": "Somewhat satisfied",
    "text": "Dislike how they track and monitor us all using this app. We should have more privacy and not have to worry about such things. Other that that I like the app. Duo it is addictive so caution when using. Beware of scams that are advertised as well",
    "rating": 4
  },
  {
    "review_id": "13539802741",
    "title": "Facebook needs to learn to sort chronologically",
    "text": "It seems Facebook no longer sorts likes by chronological order - apparently stopped this feature in December 2025. And worse, Facebook now suggests political pages to me more and more, while showing less and often none of what my friends post. FB needs to put things in chronological order. So now, why does Facebook seem to be reducing friend posts in favor of heated political pages that I don’t even follow? In 2021, FB announced it would lower news articles in the newsfeed and now in 2025 it is SUGGESTING heated political pages that I don’t follow. A totally chronological newsfeed would be best.",
    "rating": 2
  },
  {
    "review_id": "13539289259",
    "title": "El compa apg",
    "text": "Excelente aplicación",
    "rating": 5
  },
  {
    "review_id": "13536673483",
    "title": "Perché Facebook per me è diventato speciale",
    "text": "Ciao, volevo condividere un pensiero che mi sta molto a cuore. Mi piace Facebook proprio perché, per tanto tempo, non l’avevo mai usato. Poi, quasi senza accorgermene, è entrato nella mia vita in un momento importante. Da quando è iniziata la guerra in Palestina, Facebook è diventato per me uno spazio di partecipazione e di coscienza civile. Mi ha permesso di sentirmi parte di una rivolta pacifica, di un movimento di persone che non vogliono restare in silenzio davanti alla sofferenza e che credono ancora nella possibilità di fermare la guerra attraverso la voce collettiva. Grazie a Facebook ho conosciuto tante persone che la pensano come me, persone lontane ma incredibilmente vicine nei valori, nella sensibilità e nel desiderio di giustizia. Mi sono sentito meno solo e più forte, perché condividere idee e speranze crea legami veri, anche dietro uno schermo. Inoltre, adoro poter ammirare modi di vivere, culture e costumi di ogni parte del mondo. Ogni storia, ogni immagine, ogni parola è una finestra aperta su realtà diverse che arricchiscono e insegnano. Per tutto questo, Facebook non è solo un social network: per me è diventato un luogo di incontro, di ascolto e di crescita. Un caro saluto, GB",
    "rating": 5
  },
  {
    "review_id": "13538925695",
    "title": "Good social media for myself!!",
    "text": "Gumhkawng",
    "rating": 5
  },
  {
    "review_id": "13539633119",
    "title": "Dios es grande",
    "text": "La boluntad es la mejor",
    "rating": 5
  },
  {
    "review_id": "13540325810",
    "title": "Facebook",
    "text": "Una aplicación seguro para compartir fotos imágenes de lo que uno vive a diario desde Boston",
    "rating": 5
  },
  {
    "review_id": "13538884987",
    "title": "BEST",
    "text": "Best social media platform ever❤️👍",
    "rating": 5
  },
  {
    "review_id": "13537122268",
    "title": "Needs fixing",
    "text": "App does not work",
    "rating": 1
  },
  {
    "review_id": "13536950601",
    "title": "Power to the people",
    "text": "Good news",
    "rating": 5
  },
  {
    "review_id": "13535538119",
    "title": "Facebook has turned into a sewer pot",
    "text": "Too many fake posts using AI. Too many fake ads too many ads that are for companies that are dis reputable and not real too much political drama on both sides. This is not what I signed up for. I thought this was a family friendly place to share positive stories and pictures and experiences with family and friends. Is become a place for rants and hate.. such a shame",
    "rating": 1
  },
  {
    "review_id": "13535855673",
    "title": "Idiots at Facebook gave me some Latino chicks Facebook page when I signed up!",
    "text": "Are you incompetent fascists like Zuck?",
    "rating": 1
  },
  {
    "review_id": "13536228989",
    "title": "Facebook",
    "text": "Good connection",
    "rating": 5
  },
  {
    "review_id": "13535070451",
    "title": "Garbo Data Collector",
    "text": "Facebook used to be a cool place. It’s just propagates hate to collect personal data. Horrible app owned by a freak show billionaire who drinks coffee “recreationally “. Just use it for marketplace - which is getting weirder with odd AI adds that are click tricks. You try to close them out and you have a pop up message in messenger trying to sell you some weird maga supplements or something.",
    "rating": 1
  },
  {
    "review_id": "13535843369",
    "title": "Unwanted notifications",
    "text": "Facebook did something and I’m getting unwanted notification from group I hardly visit and from groups or pages I might see a post and like it .",
    "rating": 1
  },
  {
    "review_id": "13537092438",
    "title": "Confidential",
    "text": "Long time no see",
    "rating": 5
  },
  {
    "review_id": "13535100876",
    "title": "DIVERSAO E INFORMATION",
    "text": "5 star’s",
    "rating": 5
  },
  {
    "review_id": "13539383280",
    "title": "Unhappy",
    "text": "The changes with the app are terrible. You removed marketplace from me this morning with no notice or explanation and no way for me to recover it. With all of the adds and now the loss of marketplace I may just be done with Facebook all together. Extremely disappointed",
    "rating": 1
  },
  {
    "review_id": "13534942305",
    "title": "I can't recover my account",
    "text": "I lost my phone in an accident, and now whenever I try to recover my Facebook account, it keeps telling me to login using my previous device. That device is gone, so this is impossible. Even though I have both my email and phone number linked to the account, Facebook doesn't send and OTP to either of them but shows the same page insisting that I use the original device instead. I have also tried recovering the account through Meta support, but I get the exact same response. There's no live chat or real support option to speak with an agent, which is extremely frustrating for such a large company.",
    "rating": 1
  },
  {
    "review_id": "13534994207",
    "title": "Censorship",
    "text": "Does FB algorhythm censor my posts about Palestine?",
    "rating": 3
  },
  {
    "review_id": "13533165962",
    "title": "Wonderful",
    "text": "Excelente",
    "rating": 5
  },
  {
    "review_id": "13536410353",
    "title": "The new update is stupid",
    "text": "The app is becoming worse and worse everyday, Facebook was built on personal use now it just prioritizes business profiles…. I can’t edit my music, I can’t send friend requests, its terrible",
    "rating": 1
  },
  {
    "review_id": "13538461426",
    "title": "Why is the autocorrect/ pre filling words even a thing",
    "text": "Holy cow…. It is practically impossible to type a message with the auto fill of words and autocorrect. I can’t even type out a sentence without it messing up what I’m trying to type out. The absolute worst!!!!!",
    "rating": 4
  },
  {
    "review_id": "13539345913",
    "title": "Bad AI",
    "text": "Fake accounts/Hacking/Click bait/",
    "rating": 1
  },
  {
    "review_id": "13535180210",
    "title": "Most recent update sucks",
    "text": "The latest update sucks. Please put the “like” button back to the left side of the page so I’m not constantly hitting it when I’m trying to scroll. Also, when I click the “see more” of someone’s post, it’s in the same place as the like button and it’s hard to hit the correct button. Also, the format for posting a new post or sharing a meme, article or picture is ridiculous. Please change it back. All in all, too many things to list here.",
    "rating": 3
  },
  {
    "review_id": "13538744418",
    "title": "Reach",
    "text": "I want to reach more poeple and I want facebook help more 200 k Somali people In additional you fees payment is bit high although the payment section has an issue",
    "rating": 5
  },
  {
    "review_id": "13532763082",
    "title": "Modify/or Troubleshoot my sharing settings please?& please upgrade my effects?",
    "text": "Good evening!How are you feeling?Can yall modify my sharing settings,so tat I can have the option to share my Memories-post,video/reels,to Instagram please?It never gives me that option,it’s defaultly off,& it never turns on.Also can you give me some better upgraded effects???",
    "rating": 3
  },
  {
    "review_id": "13539431726",
    "title": "Garbage marketplace restrictions",
    "text": "So stupid restriction on how many chats per day is garbage how do they expect people to sell their products or buy anything when you’re restricted to like a few chats a day worthless app deleted and went to mercari and other marketplaces waste of time and stress",
    "rating": 1
  },
  {
    "review_id": "13536223829",
    "title": "Really a good place but it’s so confusing to use",
    "text": "I like Facebook, it’s going good so far, but it’s so confusing to use this place",
    "rating": 4
  },
  {
    "review_id": "13532983741",
    "title": "My hobby",
    "text": "I enjoyed very much on my free time.",
    "rating": 5
  },
  {
    "review_id": "13535156954",
    "title": "Too many ads",
    "text": "Not enough friend post",
    "rating": 2
  },
  {
    "review_id": "13539084973",
    "title": "Facebook Ratings",
    "text": "Better before Metro",
    "rating": 3
  },
  {
    "review_id": "13536788770",
    "title": "Zuck + Algo",
    "text": "They killed it good and proper. Do yourself a favor and download X.",
    "rating": 1
  },
  {
    "review_id": "13533121435",
    "title": "Zuckerberg is a criminal",
    "text": "Just delete it and never look back. It’s like they found out how to make getting paper cuts on your cuticles addictive.",
    "rating": 1
  },
  {
    "review_id": "13533422380",
    "title": "Too Many Ads",
    "text": "Too many ads.",
    "rating": 3
  },
  {
    "review_id": "13532784075",
    "title": "Behavior health re",
    "text": "Health Management",
    "rating": 5
  },
  {
    "review_id": "13539397943",
    "title": "Keeps me amused",
    "text": "In my current iteration, I really shouldn’t spend as much time as I do on the computer, but it does help to keep my attitude fluid and light.",
    "rating": 5
  },
  {
    "review_id": "13533116555",
    "title": "Too many ads",
    "text": "It seems my feed is just ads and not friend feeds. Disappointing",
    "rating": 2
  },
  {
    "review_id": "13540457180",
    "title": "Very god",
    "text": "Haha",
    "rating": 5
  },
  {
    "review_id": "13538222005",
    "title": "Phishing /hacked",
    "text": "1)Unable to securely/effectively change password. 2) Logged into a device I never logged into, recently just a few weeks ago. Says it’s from have been in a different city I haven’t been to in 6months. When I try to remove it sends me an 8 digit code and won’t let me log out of it. Did not use or click on it.",
    "rating": 2
  },
  {
    "review_id": "13536699108",
    "title": "Shares on my posts",
    "text": "THIS IS NOT TWITTER. PUT THE THING BACK SO I CAN SEE WHO SHARED MY POSTS PLEASE!!!!!",
    "rating": 1
  },
  {
    "review_id": "13536938973",
    "title": "Mr. Zuck",
    "text": "I believe that I have the best friends on Facebook in our whole world 🌎 🫡🇺🇸🇺🇸🇺🇸",
    "rating": 5
  },
  {
    "review_id": "13537269445",
    "title": "App crashes when adding verification code",
    "text": "It lets me log in but when I add the verification code it sent me to my email, it crashes and says ‘something went wrong.’",
    "rating": 1
  },
  {
    "review_id": "13536816569",
    "title": "Way too many Ads",
    "text": "Way to many Ads!!! Every other post is an ad and nothing from our friends.",
    "rating": 1
  },
  {
    "review_id": "13539423850",
    "title": "Search is broken on iPad Pro",
    "text": "Everything works *mostly* OK on my iPad Pro, except search bars in the feed and Marketplace. As soon as I try to search, everything breaks. How does this company survive like this?",
    "rating": 2
  },
  {
    "review_id": "13537360736",
    "title": "Nothing but ads",
    "text": "Nothing more than non stop ads that drown out what you see from your actual friends. Facebook has turned into adware garbage.",
    "rating": 1
  },
  {
    "review_id": "13539607660",
    "title": "Good and great",
    "text": "Nice",
    "rating": 5
  },
  {
    "review_id": "13539469950",
    "title": "M",
    "text": "Shares not working",
    "rating": 1
  },
  {
    "review_id": "13537528507",
    "title": "Mala",
    "text": "Mala",
    "rating": 1
  },
  {
    "review_id": "13537281167",
    "title": "Emotionalism",
    "text": "Sotow be upon those who do not pay it forward…who do naught act on their promises, and those who do not pay it back…🙂",
    "rating": 5
  },
  {
    "review_id": "13534222753",
    "title": "Messenger",
    "text": "Won’t allow me to access chat without downloading messenger. I don’t want that on my device.",
    "rating": 1
  },
  {
    "review_id": "13533259110",
    "title": "Follow Ups",
    "text": "Fb nor Meta never follow up correctly or timely. They just reference something else to make it worse. No human responds through the help or support inquiries.",
    "rating": 1
  },
  {
    "review_id": "13533987263",
    "title": "To much",
    "text": "To much sexual content it’s becoming horrible",
    "rating": 2
  },
  {
    "review_id": "13534160736",
    "title": "You think you know me",
    "text": "You’ve taken what Facebook was. The core of its being and turned it into the complete opposite of that. A shallow advertisement that’s sole purpose is forcing engagement in scenarios that make people upset to further more engagement.",
    "rating": 2
  },
  {
    "review_id": "13536025313",
    "title": "Ads and scans",
    "text": "Too many ads, a lot of them are scans",
    "rating": 3
  },
  {
    "review_id": "13538603001",
    "title": "Sumamente muy satisfecho",
    "text": "Me parece muy excelente",
    "rating": 5
  },
  {
    "review_id": "13540213286",
    "title": "Facebook",
    "text": "I love Facebook but hate all the ad interruptions. Also the times you can’t see the finish of something. It’s almost to the point of deleting Facebook.",
    "rating": 2
  },
  {
    "review_id": "13533526550",
    "title": "STOP SHADOW BANNING THE CONTENT I CHOOSE TO FOLLOW AND OR REPOST!!!",
    "text": "I don’t appreciate FB , holding the content that I view as important, educational and or valuable information to me by making it appear on my newsfeeds anywhere from three days to a month or more after it was original posted by the content creator or limit what I can repost and or share because you people personally have a problem with me and others FREEDOM OF SPEECH to agree and disagree and amicably, boycott, share for awareness, come to together as one to unify, educate, support and promote and make OTHERS aware of the choices we have if we join together and move accordingly. That is what you overlords are afraid of !!!",
    "rating": 1
  },
  {
    "review_id": "13540099998",
    "title": "ad",
    "text": "get rid of ads i dont care about any of the ads cause dont buy from people on line seems all i get is ads total sell outs",
    "rating": 1
  },
  {
    "review_id": "13535286866",
    "title": "Censoring",
    "text": "Constant censoring and ridiculous amount of ads. I barely get to see any posts from groups or people I actually follow anymore. Also, now I’m getting a “security scan in progress” whenever I try to swipe to see my messages and my messages won’t update either. Very annoying.",
    "rating": 1
  }
]