[
  {
    "review_id": "13540293269",
    "title": "Review!!",
    "text": "Insta updates are annoying and there are way too many restrictions now. Insta accounts are being deleted or suspended way too easily now.",
    "rating": 1
  },
  {
    "review_id": "13535730544",
    "title": "New dark mode",
    "text": "The new dark mode is absolutely horrible, it needs to be fixed asap not sure why it’s taking so long.",
    "rating": 1
  },
  {
    "review_id": "13537578703",
    "title": "Girlfriend blocked me",
    "text": "Tf is this???",
    "rating": 1
  },
  {
    "review_id": "13539104905",
    "title": "Help please",
    "text": "This is ruining my experience with this app. My account got disabled now when I try redownloading it and making a new account doesn’t work.",
    "rating": 2
  },
  {
    "review_id": "13537210482",
    "title": "new UI sucks",
    "text": "bad bad bad plesse let people just choose the locations of their tabs/icons",
    "rating": 1
  },
  {
    "review_id": "13536507899",
    "title": "Enjoying Instagram",
    "text": "But I’m not joining the fact that every time I post something on Instagram, it goes to Facebook and it says they’re not linked together. I’m not sure what’s going on and thank you. Happy holidays merry Christmas.",
    "rating": 5
  },
  {
    "review_id": "13537703449",
    "title": "they on some Elon musk stuff I need my account back",
    "text": "yea",
    "rating": 1
  },
  {
    "review_id": "13537028238",
    "title": "Turn off likes",
    "text": "You know what would be perfect for instagram if there was an optional setting of turning your likes off and comments 👌🏼everyone would loveeeee it 🫰🏼",
    "rating": 5
  },
  {
    "review_id": "13534824193",
    "title": "A review abt my instagram account lilmirr____",
    "text": "I was banned on my instagram account for no reason permeantly banned fo no reason i didnt post or do anything yall are just banning people for nothing i had stuff i really had on that account i could never get back beacause im getting banned on evey account",
    "rating": 1
  },
  {
    "review_id": "13540465408",
    "title": "Colorado",
    "text": "La mejor app",
    "rating": 5
  },
  {
    "review_id": "13536789957",
    "title": "0",
    "text": "every update is trash and make it worse just leave it the way it is. it’s not easier yall making it more complicated. go back to the old version.",
    "rating": 1
  },
  {
    "review_id": "13539846668",
    "title": "Agradecida",
    "text": "Gracias por darme la oportunidad de auto conocerme a través de este medio de comunicación. Por ir diseñando mi propósito y permitirme compartirlo con el mundo. Muchas gracias Instagram",
    "rating": 5
  },
  {
    "review_id": "13535188873",
    "title": "Worst app",
    "text": "They will ban or suspend for no reason without an answer there so weird dnt use this app 🤦🏾‍♂️😂",
    "rating": 1
  },
  {
    "review_id": "13536229055",
    "title": "Actualización 2025",
    "text": "La actualización nueva que acaba de salir es horrible,por que dividieron muchas cosas entre ellas los mensajes y ahora no puedes ver cuando cae un mensaje por qué la app no te lo notifica",
    "rating": 1
  },
  {
    "review_id": "13535738462",
    "title": "IG is RUINED",
    "text": "This new update makes it damn near impossible to use Instagram the way we used to. The algorithm doesn’t show you what your friends are posting and vice versa and the new layout is just messy and makes it harder to access your direct messages. IG is trying to hard to be like TikTok which is inevitably going to lead to less and less users. You don’t have to do everything the same because it’s working for someone else. Listen to your users. There are a ton of social media posts on X and TikTok that are mega viral and are discussing the same thing I am.",
    "rating": 1
  },
  {
    "review_id": "13536337724",
    "title": "Communication",
    "text": "And it’s very hard to get in contact with anyone when this problem occurs so you just have to wait 2 days when they give my account back.",
    "rating": 2
  },
  {
    "review_id": "13535664511",
    "title": "0/10",
    "text": "Instagram keeps taking my accounts and I don’t even barley post on them @theedaviannalashay and @fivestarrdavii I did not violate the community guidelines cause I don’t even post on it I will sue",
    "rating": 1
  },
  {
    "review_id": "13537328194",
    "title": "hate…",
    "text": "I hate this app cause why on my new account I can comment on story’s but on my Older account I CANT and why did you guys take away my Lagos and Tokyo 😡😡😡😡I used to love this app NOW I HATE IT I only keep it for friends and aesthetics..and also WE NEED TO BE ABLE TO CHOOSE OUR OWN COLOR FOR OUR NOTES😡AND STORYS I hate that green and that Sunset color for our stories AND I ALSO HATE THOSE LIMITED COLORS WE HAVE for our notes LET US CHOOSE OUR OWN COLORSSSS😡😡😡",
    "rating": 1
  },
  {
    "review_id": "13539267860",
    "title": "Difficult to navigate",
    "text": "The title says it all",
    "rating": 3
  },
  {
    "review_id": "13536956961",
    "title": "Why not",
    "text": "Not going to to subscribe, because all my personal information is going to be released to everyone.",
    "rating": 1
  },
  {
    "review_id": "13535960100",
    "title": "AI is terrible",
    "text": "App keeps filtering my comments as spam even tho I’m commenting on people I follow and vice versa who comment on my profile all the time. I wish congress would make Zuckerberg sell the new person can fire everyone who is trash about maintenance this app",
    "rating": 1
  },
  {
    "review_id": "13534752754",
    "title": "Music not working on photo post",
    "text": "Ongoing issues with music not working on posts. Tried reinstalling the app, restarting my phone, and switching account types with no fix. Another account works fine, so this seems account-specific. Please address this bug.",
    "rating": 1
  },
  {
    "review_id": "13537180607",
    "title": "terrible customer support",
    "text": "I am verified business and I cannot get in touch with anyone via enhanced support. total scam and waste of money!!",
    "rating": 1
  },
  {
    "review_id": "13539962619",
    "title": "What needs fixing",
    "text": "Algorithm has improved for people posting for entertainment and not selling. I love this. Would love to have ability to block co-workers without knowing their social media. Restore fact checking. Cambridge Analytica is a perfect example of why fact checking is absolutely necessary.",
    "rating": 3
  },
  {
    "review_id": "13534587663",
    "title": "Hashtags",
    "text": "What is this new update?? I used to get many views by hashtags now my videos only get 100 views since I’m a small creator and don’t easily get as many views as the others",
    "rating": 1
  },
  {
    "review_id": "13537241351",
    "title": "Капец",
    "text": "Ужасное обновление и зашкварное приложение стало",
    "rating": 1
  },
  {
    "review_id": "13539712966",
    "title": "new update is awful",
    "text": "By swapping the DMs, reels and search sections and removing the posting button from the middle, you have made this app very unintuitive. It is a hassle to use your app now. i should be able to swipe left and see my DMs from the main page. Went from a 5 star app to a 1 star app with this update.",
    "rating": 1
  },
  {
    "review_id": "13533733645",
    "title": "So unnecessary",
    "text": "The most recent update, putting messages center at the bottom, reducing swiping function because of it, is unintuitive and annoying.",
    "rating": 3
  },
  {
    "review_id": "13535528714",
    "title": "Account disabled for no reason!",
    "text": "What are we doing? I have used instagram since the start and my account gets disabled out of no where with all my memories? No help or support and justice on my review? This is crazy to support and app for this long and they just disable your account for no reason! This is insane honestly!!",
    "rating": 1
  },
  {
    "review_id": "13540005817",
    "title": "Güncelleme",
    "text": "Repost Güncellemesi…vs bana gelmiyor",
    "rating": 2
  },
  {
    "review_id": "13536207192",
    "title": "new update",
    "text": "this new instagram update is just ugly and dysfunctional l. it’s visually unappealing and it’s a change i think nobody wanted.",
    "rating": 1
  },
  {
    "review_id": "13536545852",
    "title": "Con algunos de los amores de mi vida❤️",
    "text": "🥰😍😍",
    "rating": 5
  },
  {
    "review_id": "13540284810",
    "title": "Log in failure",
    "text": "I can literally login using any internet browser But when I try to login using the app it says the password is wrong or JUST SHOW NOTHING AND OKAY BUTTON I HAVE NO ACCESS TO ANY OF MY ACCOUNTS IN THIS APP UNLESS I’M using a browser. They need to get this fixed! And, Literally disabling my accounts for no reason at all. This app sucks. Bring back old Instagram!",
    "rating": 1
  },
  {
    "review_id": "13536632641",
    "title": "Hashtag limit is horrible and it took away the mixed posts feature.",
    "text": "If it ain’t broke, don’t fix it. There’s no reason to get rid of the 20 hashtags and the mixed post feature.",
    "rating": 2
  },
  {
    "review_id": "13535751665",
    "title": "I Love IG",
    "text": "perfect platform to really connect with people on a personal level through DM.",
    "rating": 5
  },
  {
    "review_id": "13533793507",
    "title": "Banned for 0 cause",
    "text": "They banned my account for 0 reason, and then banned my second account after literally just creating it",
    "rating": 1
  },
  {
    "review_id": "13534004695",
    "title": "inaccurate flagging",
    "text": "their “technology” is so inaccurate with detecting content that goes against the rules. i’ve gotten banned even when following the rules extremely closely, and there is zero ways of contacting a real person to fix the issues.",
    "rating": 1
  },
  {
    "review_id": "13540532637",
    "title": "Repost",
    "text": "I absolutely love this app but I always seem to not have the updates. Instagram is updated for me but I don’t have the repost button other have. And a lot of other stuff with that but I really only care about the repost. How would I fix this to get the button? I really would like it.",
    "rating": 4
  },
  {
    "review_id": "13536709323",
    "title": "SOMETHING IS NOT WORKING",
    "text": "my music stops working randomly on my posts. it doesn’t show up when i make a post with a song.",
    "rating": 2
  },
  {
    "review_id": "13536176564",
    "title": "bad app",
    "text": "they keep suspending my acc for no reason",
    "rating": 1
  },
  {
    "review_id": "13538949575",
    "title": "Pago de publicidad",
    "text": "He pagado ayer por la mañana para publicitar un post y hasta ahora no me hacen publicidad! 🥺🥺 ya me han cobrado",
    "rating": 1
  },
  {
    "review_id": "13536822139",
    "title": "Change the message button back",
    "text": "Why would they change the message button change it back",
    "rating": 1
  },
  {
    "review_id": "13539446072",
    "title": "I Have been locked out of all my accounts",
    "text": "I dont know what this new update did but this never happened to me before. Ive had my account for about 5 years now and I was trying to change my password. I changed my password and it kicked me off my account like usual so I used the password I just made and it said it was incorrect. Soo I was like alright ill just use my gmail to recover my account like usual so my gmail sent me a code and i typed it in and nothing happened and i kept repeating the process and still nothing and now im kicked off of all my accounts with no idea how to recover them. I am very angry because ive had these accounts through the best times of my life and they have all my memories on them and it just has sentimental value to me.",
    "rating": 1
  },
  {
    "review_id": "13539125237",
    "title": "ig",
    "text": "doesn’t let me follow back its been doin this for two days now",
    "rating": 3
  },
  {
    "review_id": "13537469241",
    "title": "The new update suck",
    "text": "I absolutely hate the new layout of the app it’s so uncomfortable and so annoying like I don’t like it yall need to give us an option to go back to our old layout or customization how we want it. I want to be able to swipe left and my messages to pop up not reels this is not TikTok.",
    "rating": 1
  },
  {
    "review_id": "13536129328",
    "title": "This app sucks",
    "text": "I’m actually so mad bc I have no repost button and it’s been months. I understand that there’s been a rollout for this option but it shouldn’t take this long. Instagram if you see this please give me my repost button I’ve sent out support tickets way too many times now that no one has responded to",
    "rating": 1
  },
  {
    "review_id": "13537257146",
    "title": "Give me my account back pls",
    "text": "Disabled my account for no reason, and wrongfully suspended me because of the new meta AI, I lost my instagram account and even my Facebook account, I’m really disappointed and would love my accounts back. Pls and thank you",
    "rating": 1
  },
  {
    "review_id": "13537125964",
    "title": "Old version was perfect",
    "text": "Just doesn’t like the new version. Version before this was perfect When I’m watching reels try to scroll then it goes side ways and goes to home some times to massages",
    "rating": 4
  },
  {
    "review_id": "13540130859",
    "title": "Repeated DM messages not displaying correctly",
    "text": "Hello, Recently, I have been experiencing an ongoing issue with Instagram Direct Messages. Some messages from the other person, as well as parts of my own messages, do not appear in the chat—even though the other person has not deleted them, and I do not use Vanish Mode at all. The messages only disappear visually. When I delete the app and reinstall it, the missing messages reappear. However, this issue keeps happening repeatedly, which is extremely frustrating. Every time I need to view a specific message, I am forced to delete and reinstall the application just to see it again. I am not sure what is causing this glitch, but it seems to be a syncing or loading issue within the app. I sincerely hope that an ASAP update will fix this problem, as it significantly affects the messaging experience. Thank you for your time and support. Best regards,",
    "rating": 3
  },
  {
    "review_id": "13539671895",
    "title": "HORRIBLE CUSTOMER SERVICE!",
    "text": "There’s is ZERO assistance when you are having technical problems!!! No way to report anything! No response from this app!!! Just terrible!!!",
    "rating": 1
  },
  {
    "review_id": "13534177633",
    "title": "I hate something in the app",
    "text": "I don’t have the repost button",
    "rating": 5
  },
  {
    "review_id": "13537972219",
    "title": "Completely full of themselves",
    "text": "YOU CAN NEVER CONTROL MY POLITICAL OPINIONS. They never listen to any feedback. I don’t need your app. I don’t want Meta glasses because I hate Threads. I don’t want to see Threads because I hate Threads. You are out of touch. And yoo stupid to listen.",
    "rating": 1
  },
  {
    "review_id": "13538773176",
    "title": "ATTENTION DEVS",
    "text": "Hey devs so just two fixes I hope and pray you make! 1.) why is it after I accidentally archived my instagram story I can’t restore it to my story?? It is literally unrecoverable from the archive?? 2.) I want to be able to add music after I make a post….please 🥹 1 thing I’m loving is the grid reordering function btw great work! Best wishes, Instagram user",
    "rating": 3
  },
  {
    "review_id": "13538735118",
    "title": "Worst App Ever",
    "text": "They suspended and logged me out of my account for no reason and I can’t get back in my account until I appeal and I can’t even log into my account cause they suspended my account . Worst App Ever",
    "rating": 1
  },
  {
    "review_id": "13538996965",
    "title": "Why my Instagram is suspended ?I did not brake any rules at all but still can’t open my profile back",
    "text": "I did so many works since 4 years and spent my time and now my profile is suspended but whyyyy ??? I did not brake any rules I always follow rules !!!",
    "rating": 1
  },
  {
    "review_id": "13534097117",
    "title": "BANNED FOR NO REASON",
    "text": "my account was banned for selling “drugs and guns” when i literally never posted any of that on my account and the name of the account was “doublemyunginn3x_”",
    "rating": 1
  },
  {
    "review_id": "13540326746",
    "title": "A mess",
    "text": "How are u going to suspend my account when I did nothing wrong DONT irritate me",
    "rating": 1
  },
  {
    "review_id": "13539378579",
    "title": "Memories disabled",
    "text": "My partner sent a photo of our son and I only briefly could view and I couldn’t save. We don’t have the money for service right now and I couldn’t screenshot or save the photo. If I wanted Snapchat, I would use Snapchat. This is stupidity.",
    "rating": 1
  },
  {
    "review_id": "13538455278",
    "title": "No to instagram",
    "text": "They’ll delete all your information saying you’re violating their community guidelines even when you’re not violating anything",
    "rating": 1
  },
  {
    "review_id": "13536353604",
    "title": "GIPHY change?",
    "text": "Why would you change the GIPHY database? This new one is horrendous!! I literally won’t be using it at all anymore… Bring back the old one!!",
    "rating": 2
  },
  {
    "review_id": "13538382649",
    "title": "i deactivated my account",
    "text": "i deactivated my account because i was losing followers but as soon as i try to activated it was saying my password was wrong so i been trying all day to get my account bck and it not working it been saying “something went wrong” whole time they need to fix they server instead fixing they quality n performance",
    "rating": 1
  },
  {
    "review_id": "13536839104",
    "title": "Horrible experience.",
    "text": "Instagram banned both of my accounts for absolutely no reason at all. I do not recommend. @gabbymulanii_ @thesexiestaquariusalive",
    "rating": 1
  },
  {
    "review_id": "13537120277",
    "title": "gif fail",
    "text": "The gifs don’t work right anymore. Huge turn off. Will not use the account if they don’t come back.",
    "rating": 1
  },
  {
    "review_id": "13537294668",
    "title": "Wack",
    "text": "Anyone else having issues with commenting, while not having any account restrictions?",
    "rating": 1
  },
  {
    "review_id": "13536474904",
    "title": "blntbkaby_",
    "text": "Every time I report an account yall always wanna ban my account when I try to report an bullying account smh 🤦‍♀️ you guys deactivated my account and changed my password ❗️ I want my account back",
    "rating": 2
  },
  {
    "review_id": "13537316826",
    "title": "???",
    "text": "i got the same problem over and over i keep getting banned for no reason and everytime i try to create a new account i get banned again and this is not only happening to me tho is been happening to a lot of people i been hearing this is a problem.",
    "rating": 3
  },
  {
    "review_id": "13537417837",
    "title": "New update",
    "text": "I absolutely hate the new update. It makes me wanna stop using Instagram.",
    "rating": 1
  },
  {
    "review_id": "13537178964",
    "title": "New update nasty",
    "text": "It was way better when I swipe to the right and I can see my DM, not reels, now when I do that I have to interrupt my music for REELS.",
    "rating": 1
  },
  {
    "review_id": "13539101118",
    "title": "SO MANY BUGS",
    "text": "Y’all are too worried about censoring people when you need to be making sure your app actually works. Every update (with features nobody asked for, btw) results in a worse user experience and more bugs!!! The app is on track to be unusable.",
    "rating": 2
  },
  {
    "review_id": "13536248832",
    "title": "Horrible Security/Suspends accounts for no reason",
    "text": "I hate instagram they always randomly taking accounts away and they aren’t even sure if someone did anything or even verify it or suspend with proof they just automatically close accounts then never reply back its unacceptable.",
    "rating": 1
  },
  {
    "review_id": "13540235460",
    "title": "Scammers",
    "text": "They allow people to copy your profile to try and scam your followers. Then if you report them they say “This account doesn’t break community guidelines” or something stupid like that",
    "rating": 1
  },
  {
    "review_id": "13540072156",
    "title": "Carelessness",
    "text": "So AI is taking over and banning peoples accounts for no reasons, and i’m one of them. i have no idea shape or form on how to get my accounts back and also getting punishment for something i never did! instagram is foolish and i want my accounts back and all the memories i put on there. i hate instagram",
    "rating": 1
  },
  {
    "review_id": "13536812562",
    "title": "instagram please fix it.",
    "text": "i literally got my accounts taken for no reason this is so unprofessional. i would make. new account it would get disabled in 5 minutes ive tried to make an instagram account on different devices but it some how does the same thing everytime. i’ve made like 4 new accounts and they all got banned the same day.",
    "rating": 1
  },
  {
    "review_id": "13538000390",
    "title": "instagram ai moderation is so stupid",
    "text": "So i recently got my 7 year old instagram account disabled all because of the dumb AI moderation and was falsely accused all my chats with friends and family gone in a instant just be warned that theres always a chance you’ll get banned as well even if you don’t do anything.",
    "rating": 1
  },
  {
    "review_id": "13536977496",
    "title": "I need help",
    "text": "I didn't do anything wrong they disabled my account by mistake please help me to unlocked it please",
    "rating": 1
  },
  {
    "review_id": "13534799868",
    "title": "New update sucks!!",
    "text": "Why would they change the layout. It’s all confusing now",
    "rating": 1
  },
  {
    "review_id": "13537079097",
    "title": "ins",
    "text": "我的ins特效加载不了 因为技术问题是什么意思",
    "rating": 1
  },
  {
    "review_id": "13534757065",
    "title": "SUSPENDED?!",
    "text": "I’ve been suspended for MONTHS now all because of META!!!! TRASH APP THAT ONLY GETS TRASHIER WITH TRASHY UPDATES NOBODY ASK FOR!",
    "rating": 1
  },
  {
    "review_id": "13538863948",
    "title": "Wrongful suspension",
    "text": "My account constantly getting suspended for the same thing over and over again to just be given my account back for no wrong doing on my part and an apology saying so after days or a week of suspension at a time to again getting my account suspended again for no wrong doings. I have nothing but videos and pics of my kids, video game content that has nothing inappropriate posted…Its been almost 2weeks now n its extremely frustrating when its especially the holidays and this keeps me from communicating with friends and family since this also affects facebook and messenger. Stop falsifying suspensions and bans and plz give me my account back.",
    "rating": 1
  },
  {
    "review_id": "13538832057",
    "title": "Suspended/disabled account",
    "text": "My instagram that I been having for like 4 years. Got disabled 2 weeks ago for no reason I submitted an appeal and they still haven’t gave it back. Poor service I’m not the only one who acc keep getting taken",
    "rating": 2
  },
  {
    "review_id": "13536714462",
    "title": "Suspended my account for no reason",
    "text": "Woke up to my Instagram suspended for no reason and I followed all community guidelines",
    "rating": 1
  },
  {
    "review_id": "13538752474",
    "title": "Instagram suspended",
    "text": "My account name is \"noiggdeee” is critical for my success I believe I was mistakenly suspended and I'm respectfully asking to review any flags that led to this. on my part I have not did anything to be suspended If any action on my part has caused concern, I am more than willing to comply with all platform rules and provide any necessary verification (which I've done already) or additional information to resolve this issue.",
    "rating": 5
  },
  {
    "review_id": "13536688979",
    "title": "No",
    "text": "I can’t listen the music , like Lil baby , gunna",
    "rating": 2
  },
  {
    "review_id": "13538611714",
    "title": "Happy life",
    "text": "This is mostly amazing app to connect with others and share your thoughts and we can see what’s happening in the world.",
    "rating": 5
  },
  {
    "review_id": "13537159555",
    "title": "Suspended",
    "text": "The reason I give it a one because instagram keeps suspending my accounts which I’ve had for a very long time!! It needs better upgrading!!",
    "rating": 1
  },
  {
    "review_id": "13535349824",
    "title": "Disable",
    "text": "Can I get my account back",
    "rating": 5
  },
  {
    "review_id": "13539849411",
    "title": "Took my account!!!",
    "text": "Koko_cola__ was wrongfully took and have yet to give it back !!!",
    "rating": 1
  },
  {
    "review_id": "13533807412",
    "title": "Suspended my account for no reason",
    "text": "Suspended my account and I’m having a difficult time getting it back👎",
    "rating": 1
  },
  {
    "review_id": "13535881138",
    "title": "Ban who? Me?",
    "text": "I loved instagram and then randomly I get banned! They took my account down permanently with no warning, Out of no where, I had a private family friendly account… it’s been ban for months now and I’ve sent over 10 emails. I even paid to talk to them by becoming meta verified. Out of all the people to ban like all the OF models they ban me? I would like this fixed, I’m tired of no response or changes to the situation. I’m very displeased and I will not create a new account I have many contacts, photos, ect.. that I have no where else but this instagram account. So I would like a response and to have my account unban.",
    "rating": 1
  },
  {
    "review_id": "13535487703",
    "title": "ظلم الانستا",
    "text": "كل ما اسوي حساب يطير وره يوم بدون اي اسباب تذكر",
    "rating": 1
  },
  {
    "review_id": "13540234660",
    "title": "Fake pages",
    "text": "I like Instagram but it’s way too many Fake pages",
    "rating": 5
  },
  {
    "review_id": "13534998960",
    "title": "Bad update",
    "text": "Can we bring back the regular dms. this new update stinks I don’t want to swipe to reels.",
    "rating": 1
  },
  {
    "review_id": "13535457761",
    "title": "meta and filtering",
    "text": "i can’t stand the amount of ai on this app. it’s ridiculous and honestly makes it less enjoyable. also this app SUCKS at filtering out inappropriate media. the amount of dead people and pornography i’ve seen on this app is insane. do better!",
    "rating": 1
  },
  {
    "review_id": "13533781572",
    "title": "New update",
    "text": "Go back to the old Instagram update this new one is very unnecessary",
    "rating": 1
  },
  {
    "review_id": "13535797256",
    "title": "Scam",
    "text": "Bans people for no reason. Big scam to get people to pay for verification.",
    "rating": 1
  },
  {
    "review_id": "13535362104",
    "title": "Suspended",
    "text": "Very disappointed to see my account randomly suspended by AI when none of my posts even got “flagged”",
    "rating": 1
  },
  {
    "review_id": "13540399898",
    "title": "Settings",
    "text": "Stop switching the settings around",
    "rating": 4
  },
  {
    "review_id": "13540327670",
    "title": "They should actually look into why a account is getting banned",
    "text": "My account has been being banned for no reason at all for numerous times and I haven’t even done anything.",
    "rating": 2
  },
  {
    "review_id": "13537243790",
    "title": "BANNING MY ALL MY ACCOUNTS FOR NO REASON",
    "text": "BANNING MY ALL MY ACCOUNTS FOR NO REASON DONT GET ME WRONG INSTAGRAM IS AMAZING BUT Y’ALL NEED TO FIX THIS ISSUE IMMEDIATELY I’M TIRED OF MAKING NEW ACCOUNTS AND Y’ALL STILL BANNING ME FOR NO REASON FIX THIS IMMEDIATELY PLEASE! I have a new phone now but y’all keep on suspending MY ACCOUNTS FOR NO READON I RESPECT Y’ALL COMMUNITY GUIDELINES PLEASE FIX THIS I REPEAT PLEASE FIX THIS IMMEDIATELY IAM NOT A BOT STOP SUSPENDING MY ACCOUNT LET ME HAVE INSTAGRAM FIX THIS NOW Till this day it is happening unfortunately please fix this Instagram.",
    "rating": 2
  },
  {
    "review_id": "13537982310",
    "title": "Saved audio not showing",
    "text": "Never had an issue or problem on Instagram to hate it but just recently I noticed that when I go to my saved the ‘saved audio’ section doesn’t pop up and I don’t know how or what to fix",
    "rating": 5
  }
]