[
  {
    "review_id": "13544029104",
    "title": "TikTok: A Powerful Platform for Creativity and Engagement",
    "text": "TikTok is a highly engaging social media platform that offers a wide range of content, including entertainment, educational material, and creative expression. One of its most notable strengths is its advanced recommendation algorithm, which effectively personalizes content based on user interests and viewing behavior. This allows users to discover relevant and engaging videos with ease. The platform’s built-in editing tools are intuitive and well-designed, making it accessible for users of all experience levels to create polished and creative content. TikTok also serves as an effective space for discovering new creators and emerging trends on a global scale. Despite its many advantages, TikTok does have some limitations. The highly engaging nature of the platform can lead to excessive screen time if not used mindfully. Additionally, while much of the content is entertaining and informative, the quality and accuracy of information can vary, particularly in videos that present advice or opinions. Some users may also encounter negative interactions within comment sections, which can detract from the overall user experience. In conclusion, TikTok is a well-designed and innovative platform that successfully balances entertainment and creativity. When used responsibly, it offers significant value to users, and its strengths outweigh its drawbacks.",
    "rating": 5
  },
  {
    "review_id": "13544692859",
    "title": "Account",
    "text": "How to verify account",
    "rating": 4
  },
  {
    "review_id": "13546616756",
    "title": "I don’t like you TikTok you mean",
    "text": "I’m 13 and I got banned i thought it was 13 or over",
    "rating": 1
  },
  {
    "review_id": "13546164874",
    "title": "TIKTOK IS NOT TIKTOK ANYMORE",
    "text": "More ads than content. More AI than actual people. And now you’ve updated so copycat Threads. Social media has lost the plot quicker than Netflix.",
    "rating": 1
  },
  {
    "review_id": "13544659846",
    "title": "I LOVE YOU",
    "text": "I LOVE YOU",
    "rating": 5
  },
  {
    "review_id": "13544743462",
    "title": "Banned Content",
    "text": "App frequently bans your content now without reasoning or the ability to appeal. You just lose your posts permanently.",
    "rating": 1
  },
  {
    "review_id": "13543794096",
    "title": "iPad m5 pro",
    "text": "I cannot stream 1080p on the iPad m5 pro, I would like to but it won’t let me",
    "rating": 5
  },
  {
    "review_id": "13547303789",
    "title": "Rating",
    "text": "I use TikTok a lot but I do hate that I don’t have the ability to do slideshows or those text posts. I get the ability to use it every 4 months and I absolutely hate it. I was able to do yesterday but then it immediately went away 🫩",
    "rating": 4
  },
  {
    "review_id": "13546185117",
    "title": "Tiktok could be good",
    "text": "This app would be amazing if it didn’t support liberalism, fascism and pedophilia. Those are the only people that can survive on that app protect your children. Do not allow them to download this app. Pedophilia is running rampant on that app.",
    "rating": 1
  },
  {
    "review_id": "13543369810",
    "title": "Relatively good",
    "text": "TikTok is really good, just that •_• but i got banned for being “underage” when on the App Store, it says the age is 12+, I’m 12+",
    "rating": 3
  },
  {
    "review_id": "13543711021",
    "title": "Something wrong with tik toks shop",
    "text": "I’m literally seeing stickers of hentai and and furry pôrn",
    "rating": 1
  },
  {
    "review_id": "13542829422",
    "title": "stickers",
    "text": "How do I comment stickers I try but did not work could you fix this or you can add an update where we can comment stickers.",
    "rating": 5
  },
  {
    "review_id": "13544426649",
    "title": "whyy",
    "text": "its great but almost everyone has STICKERS..i dont. Please tiktokk",
    "rating": 4
  },
  {
    "review_id": "13544725139",
    "title": "Forced AI ChatBot",
    "text": "Why am I forced to have the AI chatbot on the app. There needs to be a way to disable that.",
    "rating": 1
  },
  {
    "review_id": "13547502464",
    "title": "Uhm",
    "text": "It’s not letting me login because I broke to many violations but I never did anything",
    "rating": 3
  },
  {
    "review_id": "13546946572",
    "title": "I’m On To You",
    "text": "Tik Tok is a VERY racist app. Period Point Blank. Shame on you Tik Tok. People of color. Stay off this garbage. Especially black people. They turn a blind eye to black issues and racism. But let yt say whatever they want. This app is horrible. If I could give it a 0 star. I would.",
    "rating": 1
  },
  {
    "review_id": "13541583362",
    "title": "streak",
    "text": "i dont know why but for some reason my tiktok doesn’t have all features my friends have such as streak pets",
    "rating": 4
  },
  {
    "review_id": "13541537934",
    "title": "Good app terrible execution.",
    "text": "This app had so much potential. Now it is again controlled by forces that don’t listen to their people. Somethings are great others suck. Apparently they will be taking away peoples freedoms further and that is truly disgusting. Fix your priorities. Make sure we all get a voice and that we can fully communicate with each other no matter the distance. Don’t take away more freedoms in this day and age where devices are basically most of our lives. Yes children are impacted however they will forever be impacted. It’s what we do in the now that will show them how to stand up and protect our freedoms and rights. Not just at the expense of us but with us. Or let’s talk about how they took away the ability for those who give actual services to others who lets say needs some clarity or understanding. That person is preforming a service yet cash app or other payment options are flagged. So so many things that honestly shouldn’t be allowed to happen are happening and the majority is so Lazer focused on survival and taking care of their families. However that doesn’t mean we don’t see the lies being fed and the actions being taken against us. This is “small” but just a part of the beginning and only a small part.",
    "rating": 1
  },
  {
    "review_id": "13541444672",
    "title": "Message",
    "text": "I can’t text people you restrict too much these days I think the old tiktok is better",
    "rating": 1
  },
  {
    "review_id": "13547390146",
    "title": "GIFs",
    "text": "Updated still can’t comment gifs",
    "rating": 2
  },
  {
    "review_id": "13544884364",
    "title": "Help",
    "text": "Make me get more views on TikTok please",
    "rating": 5
  },
  {
    "review_id": "13544071753",
    "title": "Horrible moderation",
    "text": "This apps report system is utter trash",
    "rating": 1
  },
  {
    "review_id": "13543403426",
    "title": "Narcissistic",
    "text": "I find it funny when you can report a stupid comments that’s not even offensive! But it’s okay to see a naked girl ! N I reported it n there’s nothing wrong with it ?but it’s wrong to say it’s trashy 💀yall are some narcissists.",
    "rating": 1
  },
  {
    "review_id": "13546210642",
    "title": "So good!",
    "text": "This app is good for getting info, meeting new people, dances and posting;) and Stan staykids",
    "rating": 5
  },
  {
    "review_id": "13542054452",
    "title": "age restriction",
    "text": "im 30 verified my account with my passport but live obtion dissapeared and i cant appeal .",
    "rating": 1
  },
  {
    "review_id": "13544733290",
    "title": "Love hate",
    "text": "It’s mostly ads for dumb mobile games, AI garbage, useless Lemon 8 notifications that you can’t turn off and a blocking function that doesn’t work.",
    "rating": 1
  },
  {
    "review_id": "13545005418",
    "title": "Tik tok is unwatchable.",
    "text": "I keep getting Arabic and Hebrew videos",
    "rating": 3
  },
  {
    "review_id": "13546392076",
    "title": "The update Didn’t give me my sticker",
    "text": "I updated my TikTok but they didn’t give me the sticker so am giving you four",
    "rating": 4
  },
  {
    "review_id": "13545065838",
    "title": "HASHTAGS",
    "text": "All of my videos get like 300 views instead of the 200k I used to get, the only variable I can think of to cause the change would be the hashtag limit. It’s pretty ridiculous, please remove it, or at least raise the limit.",
    "rating": 4
  },
  {
    "review_id": "13542943583",
    "title": "Horrible",
    "text": "You remove videos about cars, and firefighters etc but let naked women flash you on the for you page with zero repercussions",
    "rating": 1
  },
  {
    "review_id": "13545826190",
    "title": "Pathetic",
    "text": "Useless",
    "rating": 1
  },
  {
    "review_id": "13543267793",
    "title": "WE LOVE TIKTOK",
    "text": "It’s very good",
    "rating": 5
  },
  {
    "review_id": "13547495107",
    "title": "Good app",
    "text": "I love using this app as it’s really entertaining but I wish I could find out how to comment stickers and not just photos, so someone plz help me on doing that.",
    "rating": 5
  },
  {
    "review_id": "13544797583",
    "title": "good app until the verify update",
    "text": "I js lost like 3 of my accounts because I forgot the email I used on them and I can’t get them back now 🥹",
    "rating": 1
  },
  {
    "review_id": "13543231779",
    "title": "TikTok",
    "text": "TikTok, you shouldn’t have to have people to sign. This is just stupid. I hate hate hate people shouldn’t have to sign in. I bet those ignorant people don’t have to sign in in those Karen’s.",
    "rating": 2
  },
  {
    "review_id": "13547041317",
    "title": "You should care about your privacy",
    "text": "The fact that this app is still in the top 25 charts for 2025 is proof that Americans are still ignorant, and willing to sacrifice privacy and risk surveillance simply because of convenience and lack of motivation to find something better. I’m sorry but no matter what your political views, a surveillance state is a really scary idea to every american. If you care about that at all, you really should find a more privacy forward alternative. As long as you keep giving these companies money and/or using their products, you are contributing to the downfall of democracy and the freedom we love as patriotic Americans. Please spend a little time to educate yourself and find alternatives. “ but I have nothing to hide.” is NOT a valid reason to keep using apps like this.",
    "rating": 1
  },
  {
    "review_id": "13543743414",
    "title": "Give them back",
    "text": "Give me back my stickers.",
    "rating": 5
  },
  {
    "review_id": "13541159348",
    "title": "It doesn’t want me to go live",
    "text": "Any time it says you’ll be 2030 and that is too long",
    "rating": 1
  },
  {
    "review_id": "13543151731",
    "title": "Noah",
    "text": "I love to doom scroll",
    "rating": 5
  },
  {
    "review_id": "13547873902",
    "title": "Age restrictions",
    "text": "I feel like TikTok is really good I love it but for some reason today it logged me out of both of my accounts for “age restriction” but I showed to proof of my age and it still doesn’t let me log in to any of my accounts I had to and I got on TikTok and it said I wasn’t correct age but I had proof it doesn’t let me create new account for some reason so TikTok pls let me get my accounts back I had a lot of followers and likes and had many streaks with people so pls give me my accounts back",
    "rating": 3
  },
  {
    "review_id": "13543317686",
    "title": "U.S. Takeover",
    "text": "No Longer safe!!! All data now limited and monitored. Now just another, Instagram, Facebook, Twitter.",
    "rating": 1
  },
  {
    "review_id": "13544083698",
    "title": "Red banner",
    "text": "Honestly over TikTok maximizing profits over user experience. The red banners blocking the screen that are literally not helpful to anyone. The needing several apps to navigate using TikTok as a creator. The millions of different programs and competitions that aren’t streamlined and super confusing. How it’s difficult to see and cancel subscriptions and super fan status in the app specifically. I could go on. It’s beyond ridiculous.",
    "rating": 1
  },
  {
    "review_id": "13546896126",
    "title": "Worst social media app ever let me tell u why",
    "text": "So I made an account and I started posting videos and I play this game called “steal a Brainrot”and I’m looking to trade and I traded and then this guy named djay_sab started being racist saying that slaves killed people like me (Latinos) and then I say one mean word ONE MEAN WORD and then I got my account banned from messaging,and posting an my account is going to be deleted.WORST APP EVER DO NOT DOWNLOAD",
    "rating": 1
  },
  {
    "review_id": "13547711584",
    "title": "Amazing",
    "text": "Best app I have so entertaining I love it",
    "rating": 5
  },
  {
    "review_id": "13544976817",
    "title": "Repost",
    "text": "Make a remove all repost button please!",
    "rating": 5
  },
  {
    "review_id": "13541188716",
    "title": "No streaks",
    "text": "I cannot streaks friend and I want STREAKS",
    "rating": 2
  },
  {
    "review_id": "13540729877",
    "title": "Spam",
    "text": "So I just sign up for it and already I’m getting spam text. How I know it’s from TikTok? “Love my content”… when I just register with no content. I understand I will lose some privacy if not all my privacy but allowing others to get my info that easily is ridiculous.",
    "rating": 1
  },
  {
    "review_id": "13546658836",
    "title": "Banned account",
    "text": "Had my account for 6 plus years. TikTok bans it saying I’m impersonating someone? There is no customer service whatsoever. Not even a phone number u can call.",
    "rating": 1
  },
  {
    "review_id": "13544218018",
    "title": "Luisa",
    "text": "Pleasee TikTok add a button to reset all your reposts!",
    "rating": 5
  },
  {
    "review_id": "13542761239",
    "title": "Customer Support is a NIGHTMARE",
    "text": "The app itself is fine but getting in touch with anyone to help with any account issues is basically impossible! Why is it so difficult to get in touch with a human? There’s no chat, no phone number, and even to “request a ticket” is hard to do on the app. Please fix this and please help me get back into my account!!!",
    "rating": 1
  },
  {
    "review_id": "13543074571",
    "title": "Can I please go live",
    "text": "I want to go live but nobody follows me",
    "rating": 4
  },
  {
    "review_id": "13546804306",
    "title": "problem about the videos",
    "text": "when I post something or a lot of pictures they don’t separate, it’s turn into a video and not pictures and I wanted to be a picture I can browse on, but I can’t decide which one I wanna do pls fix this problem it’s so bad",
    "rating": 1
  },
  {
    "review_id": "13543072974",
    "title": "likes",
    "text": "stop telling me that i am tapping too fast. i wanna like videos",
    "rating": 5
  },
  {
    "review_id": "13543540075",
    "title": "Random banned",
    "text": "I was watching TikTok until, it suddenly just ban me I try put my age but it kick me out get better mods TikTok",
    "rating": 1
  },
  {
    "review_id": "13541459217",
    "title": "good",
    "text": "Its a really good ap",
    "rating": 5
  },
  {
    "review_id": "13543364099",
    "title": "DONT DELETE TIKTOK",
    "text": "This app is my pride and joy DO NOT delete it i will cry for years. Thank you",
    "rating": 5
  },
  {
    "review_id": "13543888230",
    "title": "Freaky",
    "text": "Freaky app, bro",
    "rating": 2
  },
  {
    "review_id": "13543628376",
    "title": "BOOO",
    "text": "stop shoving ai down our throats. if you’re going to introduce tako, there should be a way to disable it. AND yall need to do better at disclaiming ads & videos that are CLEARLY ai, as ai. thanks 🫩",
    "rating": 1
  },
  {
    "review_id": "13542280904",
    "title": "Static",
    "text": "Recently trying to upload, pics or videos will have obnoxious static sounds and won't upload at all saying failed",
    "rating": 1
  },
  {
    "review_id": "13544268137",
    "title": "I love the app",
    "text": "You should get this app it’s really cool because I got a kid TikTok and he got a grown-up TikTok so",
    "rating": 5
  },
  {
    "review_id": "13544221350",
    "title": "خرب مذاكرتي",
    "text": "بسببه ما عرفت أذاكر و نتايجي خرا صارت نصيحه الي عنده مدرسة او جامعه يحذفه فورا لان يسرق وقت مذاكره",
    "rating": 1
  },
  {
    "review_id": "13543546709",
    "title": "Need duplicate feature",
    "text": "capcut is still better to edit videos on, no duplicate feature in the editing mode, making content hard to produce",
    "rating": 3
  },
  {
    "review_id": "13547043408",
    "title": "Comments gone!",
    "text": "TikTok fix the comments! They just disappear whether they are mine or someone else responding to me. Ridiculous!",
    "rating": 1
  },
  {
    "review_id": "13541252114",
    "title": "The app SUCKS",
    "text": "Hello I got this app and it was going good at the start until it said I was “too young” so it said it was gonna BAN ME and I made so many friends and followers and many fun moments that made the app feel special so I tryed to defend myself but the stupid stuff didnt work so now I can’t watch TikTok (the go to app for watching videos for me)and now I’m here and I still dunno know why they did this earlier so now I’m stuck with YouTube and brainrot kids (I also made edits that well are now much are just a waste) SO DONT GET TIKTOK",
    "rating": 1
  },
  {
    "review_id": "13546362349",
    "title": "Kinda",
    "text": "Okay I kinda like TikTok but they be letting people ban other people for no reason, i literally commented on a video, showing a man putting a shoe on another man but there was nothing inappropriate about that, I’ve seen people with memes that are NAKED and TikTok is just gonna delete MY comment instead of theres",
    "rating": 3
  },
  {
    "review_id": "13547775362",
    "title": "Elchele",
    "text": "El guapo",
    "rating": 5
  },
  {
    "review_id": "13541405154",
    "title": "I NEED MY HASHTAGS BRO",
    "text": "Back before the 5 hashtag update, my videos would get up to 100 likes and 3000 views, now I can’t even get my videos past 20😭✌️",
    "rating": 3
  },
  {
    "review_id": "13547076981",
    "title": ".",
    "text": "why is there so much racism? and yall not doing nothing abt it shi sad🤣🤣",
    "rating": 1
  },
  {
    "review_id": "13542654955",
    "title": "Stickers",
    "text": "I can't comment a goddamn sticker TikTok.",
    "rating": 2
  },
  {
    "review_id": "13547552154",
    "title": "super good",
    "text": "best content",
    "rating": 5
  },
  {
    "review_id": "13542541105",
    "title": "TikTok Is Very Helpful and Has Helped Me Grow in Popularity",
    "text": "TikTok is a very helpful social media app that allows people to share short videos with others around the world. It has helped me grow in popularity by giving me a platform to show my creativity, interests, and personality. Because TikTok reaches a large audience, my videos can be seen by many people, even if they do not already follow me. One way TikTok helps me grow in popularity is through its “For You” page. This feature shows my videos to people who might enjoy them based on their interests. When people like, comment, or share my videos, more users get to see them. This helps my content spread quickly and allows me to gain more followers. TikTok is also helpful because it lets me connect with others who enjoy the same things I do. I can interact with people through comments, duets, and trends. This makes it easier to make friends and feel part of a community. Creating videos also helps me build confidence and improve skills like communication and creativity. In conclusion, TikTok has been very helpful and has helped me grow in popularity by giving me a way to share my ideas, connect with others, and reach a wide audience. When used responsibly, TikTok can be a positive tool for self-expression and growth.",
    "rating": 5
  },
  {
    "review_id": "13547004509",
    "title": "WHERES MY PHOTOS AT HO",
    "text": "I downloaded TikTok back and they removed the ability to comment photos WHAT I DO😡",
    "rating": 1
  },
  {
    "review_id": "13544335873",
    "title": "Jew Scum App",
    "text": "You know that you weren’t allowed to have this app anymore unless ByteDance basically gave up all control, right? You get nothing but goyslop 24/7 now. Good luck. The only way to fix this world is to eradicate these kike scum. When will you finally admit it?? You’re part of the problem. Yes, you reading this.",
    "rating": 1
  },
  {
    "review_id": "13544391192",
    "title": "How i do search",
    "text": "1",
    "rating": 1
  },
  {
    "review_id": "13543358469",
    "title": "Great app be",
    "text": "Good app",
    "rating": 5
  },
  {
    "review_id": "13544925075",
    "title": "its so bad",
    "text": "the tiktok shop shipping its too much money im trying to get something for my son and its 41 dollars for shipping that’s insane!!",
    "rating": 1
  },
  {
    "review_id": "13545341109",
    "title": "AirPlay Change Ruined Experience",
    "text": "The change in how the Airplay/Screen Mirroring is presented is worse and should be changed to how it worked previously. While my phone is mirrored to my MacBook - I cant see videos play on my phone - I cant see the comments on the screen of my laptop A big reason I even use AirPlay for TikTok is so that I use my 3.5mm earbuds so I don't have to switch to the USB-C that goes on my phone. It would be highly appreciated if TikTok would consider bringing these features back to make the AirPlay/Screen Mirroring experience much more pleasant and convenient. Thank you",
    "rating": 3
  },
  {
    "review_id": "13543125062",
    "title": "why I gave it a low rating",
    "text": "I can't text on TikTok anymore",
    "rating": 2
  },
  {
    "review_id": "13544679851",
    "title": "Gay",
    "text": "I saw people bread",
    "rating": 5
  },
  {
    "review_id": "13540863939",
    "title": "Most recent TikTok review",
    "text": "lol",
    "rating": 5
  },
  {
    "review_id": "13547180708",
    "title": "You blocked my account",
    "text": "You blocked my account",
    "rating": 5
  },
  {
    "review_id": "13545996978",
    "title": "Stickers and pics",
    "text": "Remove stickers and pics in comment section because people are posting r34",
    "rating": 5
  },
  {
    "review_id": "13541696017",
    "title": "Knowledge",
    "text": "This is the best app ever created the first time I use this app and I love it so much and I love the fact that it has a lot of features and features that make it easy",
    "rating": 5
  },
  {
    "review_id": "13543407234",
    "title": "Siraj khan",
    "text": "K100",
    "rating": 5
  },
  {
    "review_id": "13541506993",
    "title": "Need help deleting an old account I can’t get to because of old broken phone",
    "text": "I have an old account I made I was not the right age for the app and I have my face and identity on the app so please TikTok can you help me get rid of it or ban it 🙏 I was just a child and my face is on it and my full name please help me TikTok i tried TikTok support and trying to report my old account to get it banned but it does nothing please respond it’s very important for my safety i have no password I remember with it please respond thank you.",
    "rating": 2
  },
  {
    "review_id": "13545801230",
    "title": "Love/hate you TikTok",
    "text": "Okay so I don’t know why TikTok banned my account if I didn’t do nothing WRONG.",
    "rating": 1
  },
  {
    "review_id": "13543613635",
    "title": "Auto scroll….",
    "text": "Auto scroll gone again 🫩",
    "rating": 1
  },
  {
    "review_id": "13547156722",
    "title": "What I think y’all should add",
    "text": "TikTok is a great app! I been using for years! But I think it’s time to have a little glow up like letting people have banner like discord and rednote also a lot of people are tried pinning their 3 videos having them as their banner and if you guys do I’ll like you to not have them as premium some people don’t have the money for it, and you should make profile frames like discord it will look cute with banner and pfp if they match, Thank You!",
    "rating": 5
  },
  {
    "review_id": "13543096619",
    "title": "Great way to find anything and have a great laugh",
    "text": "I love TikTok if you don’t have it get it",
    "rating": 5
  },
  {
    "review_id": "13544770007",
    "title": "Ads",
    "text": "Ads ads ads ads normal post ads ads ads ads ads",
    "rating": 2
  },
  {
    "review_id": "13543625306",
    "title": "Glitches and annoying UI changes",
    "text": "Everyone knows tiktok is one of the best apps on the planet right now. I think a lot of that has to do with the algorithm and the content being pushed out by normal people. But things have GOT to change. there’s are many issues with this app. 1. The glitches: the app constantly crashes when users try to stitch or duet videos, and both features are overall gimmicky and don’t run well. 2. Their report system. Tiktok is slowly turning into Twitter with the amount of normalized hate and lack of empathy from commenters. I see the n word being commented with NO consequence from the report system after reporting, yet I call someone fat after they literally defend slavery and my comment will get removed. 3. The constant UI changes are annoying and unnecessary. It makes the app harder and harder to use, especially in the editing process. I believe we’re slowly witnessing the fall of this app.",
    "rating": 2
  },
  {
    "review_id": "13546241169",
    "title": "Kids",
    "text": "Not appropriate for kids",
    "rating": 1
  },
  {
    "review_id": "13544752843",
    "title": "Algo mm",
    "text": "Es bueno me entretiene es adictivo pero tiene algunas cosas que no funcionan entran trabadas y siempre que comparto algo me sale que no se puso en mi lista de compartidos y llega así días y semanas",
    "rating": 3
  },
  {
    "review_id": "13545943218",
    "title": "5 hashtags",
    "text": "Yall is really killing me with the 5 hashtags and the “ use more accurate hashtags to get more views” that’s a straight up lie. Y’all know what yall was doing. And now since this stupid update, my views have been hitting rock bottom. BEFORE the update, I had like almost 40k views everyttime I post with more hashtags. NOW I have been getting almost 200 views every time I post. Like my account was literally blowing up until yall added this bull rap for real and that’s why yall getting banned now cause yall stupid, and that’s why when VINE comes back yea the APP, yall gonna see decline in yalls analysis or whatever. Cause this stupid app is gonna go to shambles.",
    "rating": 1
  },
  {
    "review_id": "13541544135",
    "title": "Idk",
    "text": "I met the most amazing people on it omg so many online friends!!!",
    "rating": 5
  },
  {
    "review_id": "13547796780",
    "title": "Play now",
    "text": "Wow just wow",
    "rating": 5
  },
  {
    "review_id": "13544914262",
    "title": "Update",
    "text": "Update",
    "rating": 5
  },
  {
    "review_id": "13546683032",
    "title": "Comments",
    "text": "Please let us repost comments too",
    "rating": 4
  },
  {
    "review_id": "13544026986",
    "title": "my account",
    "text": "1 star I love TikTok and did for years but i have a feeling their trying to take my account and I don’t want that to happen their trying to say im under 18? When im not if yall can’t let me go live please help my account is randomgorgeousgirlloll",
    "rating": 1
  },
  {
    "review_id": "13544807351",
    "title": "Stickers got deleted",
    "text": "So basically i got the sticker feature but one day when i was done with my exams i watched youtube for a bit and went on tiktok i messaged my cousin but so i hsd a sticker feature where you can comment i also created stickers but when i tried to comment stickers all of stickers i had were deleted,i hope you fix this problem",
    "rating": 4
  }
]